memovie/app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)

        if @article.save
---
INSERT INTO "articles" ("title", "text", "theater", "watched_date", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @article = Article.find(params[:id])

        if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "rate" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["rate", 4], ["updated_at", "2020-05-01 12:17:40.499966"], ["id", 3]]

    def search
        @articles = Article.search(params[:search])
---
SELECT "articles".* FROM "articles" WHERE (title LIKE '%MOVIX%' OR theater LIKE '%MOVIX%' OR watched_date LIKE '%MOVIX%')